Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/atdf/PIC32CZ4010CA91176.atdf
          </instance>
        </module>
        <module name="DMA" id="03639" name2="dma_axi_apb_v1" version="1a0">
          <instance name="DMA">
            <register-group name="DMA" name-in-module="DMA" address-space="base" offset="0x44850000"/>
            <parameters>
              <param name="DMAC_ID_EVSYS" value="1" caption="Events trigger index"/>
              <param name="DMAC_ID_SWTRG" value="0" caption="Software trigger index"/>
              <param name="INSTANCE_ID" value="19" caption="Instance index for DMA"/>
              <param name="MCLK_ID_APB" value="25" caption="Index for DMA APB clock"/>
              <param name="MCLK_ID_AXI" value="24" caption="Index for DMA AXI clock"/>
              <param name="PAC_ID" value="19" caption="Index for DMA registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="DRMTCM" id="03770" name2="drm_tcm_ecc_v1" version="1a0">
          <instance name="DRMTCM">
            <register-group name="DRMTCM" name-in-module="DRMTCM" address-space="base" offset="0x44820000"/>
            <parameters>
              <param name="DPTRMSB" value="5"/>
              <param name="DTCMADDR_MSB" value="16"/>
              <param name="DTCMPAR" value="7"/>
              <param name="IPTRMSB" value="6"/>
              <param name="ITCMADDR_MSB" value="16"/>
              <param name="ITCMPAR" value="8"/>
              <param name="NO_ECC" value="0"/>
              <param name="INSTANCE_ID" value="15" caption="Instance index for DRMTCM"/>
              <param name="MCLK_ID_APB" value="19" caption="Index for DRMTCM APB clock"/>
              <param name="PAC_ID" value="15" caption="Index for DRMTCM registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="DSU" id="03716" name2="icd_dsu_u2810_v2" version="2a0">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x44000000"/>
            <signals>
              <signal group="PMSA" index="0" function="dsu_pmsa0" pad="PA14"/>
              <signal group="PMSA" index="1" function="dsu_pmsa0" pad="PA12"/>
              <signal group="PMSA" index="2" function="dsu_pmsa0" pad="PA11"/>
              <signal group="PMSA" index="3" function="dsu_pmsa0" pad="PA09"/>
              <signal group="PMSA" index="4" function="dsu_pmsa0" pad="PA07"/>
              <signal group="PMSA" index="5" function="dsu_pmsa0" pad="PA06"/>
              <signal group="PMSA" index="6" function="dsu_pmsa0" pad="PA04"/>
              <signal group="PMSA" index="7" function="dsu_pmsa0" pad="PA02"/>
            </signals>
            <parameters>
              <param name="BMX_ERROR_SUPPORT" value="1" caption="Defines whether DSU APB errors are reported as 2-cycles bus errors to the AHB AP0 master"/>
              <param name="DAL1_IMPLEMENTED" value="0" caption="Debug Access Level 1 (Non-Secure) Implemented? for TZ devices only"/>
              <param name="DMAC_ID_DCC0" value="2" caption="DMAC ID for DCC0 register"/>
              <param name="DMAC_ID_DCC1" value="3" caption="DMAC ID for DCC1 register"/>
              <param name="INSTANCE_ID" value="0" caption="Instance index for DSU"/>
              <param name="MCLK_ID_AHB" value="0" caption="Index for DSU AHB clock"/>
              <param name="MCLK_ID_APB" value="1" caption="Index for DSU APB clock"/>
              <param name="PAC_ID" value="0" caption="Index for DSU registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="DWT" id="SYSTEM_IP" version="1.0.0">
          <instance name="DWT">
            <register-group name="DWT" name-in-module="DWT" address-space="base" offset="0xE0001000"/>
          </instance>
        </module>
        <module name="EBI" id="03591" name2="emb_hsmc3_v1" version="1a0">
          <instance name="EBI">
            <register-group name="EBI" name-in-module="EBI" address-space="base" offset="0x458B0000"/>
            <signals>
              <signal group="A" index="2" function="E" pad="PC19"/>
              <signal group="A" index="3" function="E" pad="PC18"/>
              <signal group="A" index="4" function="E" pad="PC17"/>
              <signal group="A" index="5" function="E" pad="PC15"/>
              <signal group="A" index="6" function="E" pad="PC14"/>
              <signal group="A" index="7" function="E" pad="PC29"/>
              <signal group="A" index="8" function="E" pad="PC13"/>
              <signal group="A" index="9" function="E" pad="PC12"/>
              <signal group="A" index="10" function="E" pad="PC28"/>
              <signal group="A" index="11" function="E" pad="PG03"/>
              <signal group="A" index="12" function="E" pad="PC27"/>
              <signal group="A" index="13" function="E" pad="PC11"/>
              <signal group="A" index="14" function="E" pad="PC10"/>
              <signal group="A" index="15" function="E" pad="PG02"/>
              <signal group="A" index="16" function="E" pad="PG01"/>
              <signal group="A" index="17" function="E" pad="PG00"/>
              <signal group="A" index="18" function="E" pad="PC26"/>
              <signal group="A" index="19" function="E" pad="PC31"/>
              <signal group="A" index="20" function="E" pad="PC30"/>
              <signal group="A" index="21" function="E" pad="PC25"/>
              <signal group="A" index="22" function="E" pad="PC09"/>
              <signal group="A" index="23" function="E" pad="PC24"/>
              <signal group="D" index="0" function="E" pad="PD13"/>
              <signal group="D" index="1" function="E" pad="PD23"/>
              <signal group="D" index="2" function="E" pad="PD14"/>
              <signal group="D" index="3" function="E" pad="PD02"/>
              <signal group="D" index="4" function="E" pad="PD15"/>
              <signal group="D" index="5" function="E" pad="PD03"/>
              <signal group="D" index="6" function="E" pad="PD16"/>
              <signal group="D" index="7" function="E" pad="PD17"/>
              <signal group="D" index="8" function="E" pad="PD04"/>
              <signal group="D" index="9" function="E" pad="PD18"/>
              <signal group="D" index="10" function="E" pad="PD19"/>
              <signal group="D" index="11" function="E" pad="PD05"/>
              <signal group="D" index="12" function="E" pad="PD06"/>
              <signal group="D" index="13" function="E" pad="PD20"/>
              <signal group="D" index="14" function="E" pad="PD21"/>
              <signal group="D" index="15" function="E" pad="PD07"/>
              <signal group="NBS0_A0" function="E" pad="PC23"/>
              <signal group="NBS1_NWR1" function="E" pad="PC06"/>
              <signal group="NBS2_NWR2_A1" function="E" pad="PC20"/>
              <signal group="NCS" index="0" function="E" pad="PC08"/>
              <signal group="NCS" index="1" function="E" pad="PC07"/>
              <signal group="NCS" index="2" function="E" pad="PC22"/>
              <signal group="NCS" index="3" function="E" pad="PC21"/>
              <signal group="NRD" function="E" pad="PC05"/>
              <signal group="NWAIT" function="E" pad="PD08"/>
              <signal group="NWE_NWR0" function="E" pad="PC04"/>
            </signals>
            <parameters>
              <param name="ACTIVE_BS" value="0" caption="NBS signal porlarity"/>
              <param name="ACTIVE_CS" value="0" caption="NCS signal polarity"/>
              <param name="ACTIVE_RD" value="0" caption="NRD signal polarity"/>
              <param name="ACTIVE_WR" value="0" caption="NWR signal polarity"/>
              <param name="DATA_PATH_NBR_XOR_LAYERS" value="2" caption="Number of XOR layers in datapath"/>
              <param name="DIFF_CHIP_ID" value="0x554E" caption="2 ASCII characters to differentiate chips (0x554E &lt;--&gt; &quot;UN&quot;)"/>
              <param name="EMC_DELAY_REGISTER" value="0" caption="Electro Magnetic Compatibility control registers embedded ?"/>
              <param name="EX_WAIT" value="0" caption="External Wait signal polarity"/>
              <param name="MEM_ADDR_SIZE" value="22" caption="Memory Interface size (aligned 32 bits)"/>
              <param name="NB_CS" value="4" caption="Number of Chip Select"/>
              <param name="NB_PAD_NOE" value="16" caption="Number of Pad Control"/>
              <param name="OCMS_INTERFACE" value="0" caption="Off Chip Memory Scrambling implemented ?"/>
              <param name="OVERLOADED" value="1" caption="Overloaded Mode implemented ?"/>
              <param name="MCLK_ID_AHB" value="75" caption="Index for EBI AHB clock"/>
              <param name="MCLK_ID_APB" value="76" caption="Index for EBI APB clock"/>
            </parameters>
          </instance>
        </module>
        <module name="EIC" id="03706" name2="int_eic_u2804_v1" version="1b0">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x44800000"/>
            <signals>
              <signal group="EXTINT" index="0" function="A" pad="PA00"/>
              <signal group="EXTINT" index="0" function="A" pad="PA16"/>
              <signal group="EXTINT" index="0" function="A" pad="PB00"/>
              <signal group="EXTINT" index="0" function="A" pad="PB16"/>
              <signal group="EXTINT" index="0" function="A" pad="PC00"/>
              <signal group="EXTINT" index="0" function="A" pad="PD00"/>
              <signal group="EXTINT" index="0" function="A" pad="PD15"/>
              <signal group="EXTINT" index="0" function="A" pad="PE00"/>
              <signal group="EXTINT" index="0" function="A" pad="PG00"/>
              <signal group="EXTINT" index="1" function="A" pad="PA01"/>
              <signal group="EXTINT" index="1" function="A" pad="PA17"/>
              <signal group="EXTINT" index="1" function="A" pad="PB01"/>
              <signal group="EXTINT" index="1" function="A" pad="PB17"/>
              <signal group="EXTINT" index="1" function="A" pad="PC01"/>
              <signal group="EXTINT" index="1" function="A" pad="PC02"/>
              <signal group="EXTINT" index="1" function="A" pad="PC17"/>
              <signal group="EXTINT" index="1" function="A" pad="PD01"/>
              <signal group="EXTINT" index="1" function="A" pad="PD16"/>
              <signal group="EXTINT" index="1" function="A" pad="PE01"/>
              <signal group="EXTINT" index="1" function="A" pad="PG01"/>
              <signal group="EXTINT" index="2" function="A" pad="PA02"/>
              <signal group="EXTINT" index="2" function="A" pad="PA18"/>
              <signal group="EXTINT" index="2" function="A" pad="PB02"/>
              <signal group="EXTINT" index="2" function="A" pad="PB18"/>
              <signal group="EXTINT" index="2" function="A" pad="PC18"/>
              <signal group="EXTINT" index="2" function="A" pad="PD02"/>
              <signal group="EXTINT" index="2" function="A" pad="PD17"/>
              <signal group="EXTINT" index="2" function="A" pad="PE02"/>
              <signal group="EXTINT" index="2" function="A" pad="PG02"/>
              <signal group="EXTINT" index="3" function="A" pad="PA03"/>
              <signal group="EXTINT" index="3" function="A" pad="PA19"/>
              <signal group="EXTINT" index="3" function="A" pad="PB03"/>
              <signal group="EXTINT" index="3" function="A" pad="PB19"/>
              <signal group="EXTINT" index="3" function="A" pad="PC03"/>
              <signal group="EXTINT" index="3" function="A" pad="PC19"/>
              <signal group="EXTINT" index="3" function="A" pad="PD03"/>
              <signal group="EXTINT" index="3" function="A" pad="PD18"/>
              <signal group="EXTINT" index="3" function="A" pad="PE03"/>
              <signal group="EXTINT" index="3" function="A" pad="PG03"/>
              <signal group="EXTINT" index="4" function="A" pad="PA04"/>
              <signal group="EXTINT" index="4" function="A" pad="PA05"/>
              <signal group="EXTINT" index="4" function="A" pad="PA20"/>
              <signal group="EXTINT" index="4" function="A" pad="PB04"/>
              <signal group="EXTINT" index="4" function="A" pad="PB20"/>
              <signal group="EXTINT" index="4" function="A" pad="PC04"/>
              <signal group="EXTINT" index="4" function="A" pad="PD04"/>
              <signal group="EXTINT" index="4" function="A" pad="PD19"/>
              <signal group="EXTINT" index="5" function="A" pad="PA21"/>
              <signal group="EXTINT" index="5" function="A" pad="PB05"/>
              <signal group="EXTINT" index="5" function="A" pad="PB21"/>
              <signal group="EXTINT" index="5" function="A" pad="PC05"/>
              <signal group="EXTINT" index="5" function="A" pad="PC21"/>
              <signal group="EXTINT" index="5" function="A" pad="PD05"/>
              <signal group="EXTINT" index="5" function="A" pad="PD20"/>
              <signal group="EXTINT" index="5" function="A" pad="PF05"/>
              <signal group="EXTINT" index="6" function="A" pad="PA06"/>
              <signal group="EXTINT" index="6" function="A" pad="PA22"/>
              <signal group="EXTINT" index="6" function="A" pad="PB06"/>
              <signal group="EXTINT" index="6" function="A" pad="PB22"/>
              <signal group="EXTINT" index="6" function="A" pad="PC06"/>
              <signal group="EXTINT" index="6" function="A" pad="PC22"/>
              <signal group="EXTINT" index="6" function="A" pad="PD06"/>
              <signal group="EXTINT" index="6" function="A" pad="PD21"/>
              <signal group="EXTINT" index="7" function="A" pad="PA07"/>
              <signal group="EXTINT" index="7" function="A" pad="PA23"/>
              <signal group="EXTINT" index="7" function="A" pad="PB07"/>
              <signal group="EXTINT" index="7" function="A" pad="PB23"/>
              <signal group="EXTINT" index="7" function="A" pad="PC07"/>
              <signal group="EXTINT" index="7" function="A" pad="PC23"/>
              <signal group="EXTINT" index="7" function="A" pad="PD07"/>
              <signal group="EXTINT" index="7" function="A" pad="PD23"/>
              <signal group="EXTINT" index="8" function="A" pad="PA08"/>
              <signal group="EXTINT" index="8" function="A" pad="PA24"/>
              <signal group="EXTINT" index="8" function="A" pad="PB08"/>
              <signal group="EXTINT" index="8" function="A" pad="PB24"/>
              <signal group="EXTINT" index="8" function="A" pad="PC08"/>
              <signal group="EXTINT" index="8" function="A" pad="PC24"/>
              <signal group="EXTINT" index="8" function="A" pad="PD08"/>
              <signal group="EXTINT" index="9" function="A" pad="PA09"/>
              <signal group="EXTINT" index="9" function="A" pad="PA25"/>
              <signal group="EXTINT" index="9" function="A" pad="PB09"/>
              <signal group="EXTINT" index="9" function="A" pad="PB25"/>
              <signal group="EXTINT" index="9" function="A" pad="PC09"/>
              <signal group="EXTINT" index="9" function="A" pad="PC25"/>
              <signal group="EXTINT" index="9" function="A" pad="PD09"/>
              <signal group="EXTINT" index="10" function="A" pad="PA10"/>
              <signal group="EXTINT" index="10" function="A" pad="PA26"/>
              <signal group="EXTINT" index="10" function="A" pad="PB10"/>
              <signal group="EXTINT" index="10" function="A" pad="PB26"/>
              <signal group="EXTINT" index="10" function="A" pad="PC10"/>
              <signal group="EXTINT" index="10" function="A" pad="PC26"/>
              <signal group="EXTINT" index="10" function="A" pad="PD10"/>
              <signal group="EXTINT" index="11" function="A" pad="PA11"/>
              <signal group="EXTINT" index="11" function="A" pad="PA27"/>
              <signal group="EXTINT" index="11" function="A" pad="PB11"/>
              <signal group="EXTINT" index="11" function="A" pad="PB27"/>
              <signal group="EXTINT" index="11" function="A" pad="PC11"/>
              <signal group="EXTINT" index="11" function="A" pad="PC27"/>
              <signal group="EXTINT" index="11" function="A" pad="PD11"/>
              <signal group="EXTINT" index="12" function="A" pad="PA12"/>
              <signal group="EXTINT" index="12" function="A" pad="PA28"/>
              <signal group="EXTINT" index="12" function="A" pad="PB12"/>
              <signal group="EXTINT" index="12" function="A" pad="PB28"/>
              <signal group="EXTINT" index="12" function="A" pad="PC12"/>
              <signal group="EXTINT" index="12" function="A" pad="PC28"/>
              <signal group="EXTINT" index="12" function="A" pad="PD12"/>
              <signal group="EXTINT" index="13" function="A" pad="PA13"/>
              <signal group="EXTINT" index="13" function="A" pad="PA29"/>
              <signal group="EXTINT" index="13" function="A" pad="PB13"/>
              <signal group="EXTINT" index="13" function="A" pad="PB29"/>
              <signal group="EXTINT" index="13" function="A" pad="PC13"/>
              <signal group="EXTINT" index="13" function="A" pad="PC29"/>
              <signal group="EXTINT" index="14" function="A" pad="PA14"/>
              <signal group="EXTINT" index="14" function="A" pad="PA30"/>
              <signal group="EXTINT" index="14" function="A" pad="PB14"/>
              <signal group="EXTINT" index="14" function="A" pad="PB30"/>
              <signal group="EXTINT" index="14" function="A" pad="PC14"/>
              <signal group="EXTINT" index="14" function="A" pad="PC30"/>
              <signal group="EXTINT" index="14" function="A" pad="PD13"/>
              <signal group="EXTINT" index="15" function="A" pad="PA15"/>
              <signal group="EXTINT" index="15" function="A" pad="PA31"/>
              <signal group="EXTINT" index="15" function="A" pad="PB15"/>
              <signal group="EXTINT" index="15" function="A" pad="PB31"/>
              <signal group="EXTINT" index="15" function="A" pad="PC15"/>
              <signal group="EXTINT" index="15" function="A" pad="PC31"/>
              <signal group="EXTINT" index="15" function="A" pad="PD14"/>
              <signal group="NMI" function="A" pad="PC20"/>
            </signals>
            <parameters>
              <param name="EXTINT_NUM" value="16" caption="Number of external interrupts"/>
              <param name="GCLK_ID" value="5" caption="Generic Clock index"/>
              <param name="NUMBER_OF_CONFIG_REGS" value="2" caption="Number of CONFIG registers"/>
              <param name="NUMBER_OF_INTERRUPTS" value="16" caption="Number of external interrupts (obsolete)"/>
              <param name="SECURE_IMPLEMENTED" value="0" caption="Security Configuration implemented?"/>
              <param name="INSTANCE_ID" value="13" caption="Instance index for EIC"/>
              <param name="MCLK_ID_APB" value="16" caption="Index for EIC APB clock"/>
              <param name="PAC_ID" value="13" caption="Index for EIC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="ETH" id="03792" name2="eth_gem_apb_v1" version="1a0">
          <instance name="ETH">
            <register-group name="ETH" name-in-module="ETH" address-space="base" offset="0x45070000"/>
            <signals>
              <signal group="COL" function="K" pad="PD08"/>
              <signal group="CRS" function="K" pad="PD09"/>
              <signal group="GTX_CLK" function="L" pad="PD05"/>
              <signal group="MDC" function="K" pad="PA03"/>
              <signal group="MDIO" function="K" pad="PA04"/>
              <signal group="REF_CLK" function="K" pad="PD12"/>
              <signal group="RXD" index="0" function="K" pad="PD11"/>
              <signal group="RXD" index="1" function="K" pad="PD10"/>
              <signal group="RXD" index="2" function="K" pad="PD07"/>
              <signal group="RXD" index="3" function="K" pad="PD06"/>
              <signal group="RXD" index="4" function="K" pad="PD20"/>
              <signal group="RXD" index="5" function="K" pad="PD21"/>
              <signal group="RXD" index="6" function="K" pad="PD19"/>
              <signal group="RXD" index="7" function="K" pad="PD18"/>
              <signal group="RXDV" function="K" pad="PA05"/>
              <signal group="RXER" function="K" pad="PA06"/>
              <signal group="RX_CLK" function="L" pad="PD12"/>
              <signal group="TSUCOMP" function="K" pad="PA22"/>
              <signal group="TSUCOMP" function="K" pad="PC05"/>
              <signal group="TSUCOMP" function="K" pad="PC17"/>
              <signal group="TXD" index="0" function="K" pad="PA01"/>
              <signal group="TXD" index="1" function="K" pad="PA00"/>
              <signal group="TXD" index="2" function="K" pad="PD04"/>
              <signal group="TXD" index="3" function="K" pad="PD03"/>
              <signal group="TXD" index="4" function="K" pad="PD17"/>
              <signal group="TXD" index="5" function="K" pad="PD16"/>
              <signal group="TXD" index="6" function="K" pad="PD15"/>
              <signal group="TXD" index="7" function="K" pad="PD14"/>
              <signal group="TXEN" function="K" pad="PA02"/>
              <signal group="TXER" function="K" pad="PD02"/>
              <signal group="TX_CLK" function="K" pad="PA21"/>
              <signal group="TX_CLK" function="K" pad="PD05"/>
            </signals>
            <parameters>
              <param name="GCLK_ID_TSU" value="55" caption="1588 External Clock"/>
              <param name="GCLK_ID_TX" value="54" caption="GIGE/Loopback clock"/>
              <param name="MEM_MARGINADJ_MSB" value="9" caption="Number of Memory Margin Adjust bits"/>
              <param name="NUM_INT" value="6" caption="Number of Interrupts"/>
              <param name="INSTANCE_ID" value="56" caption="Instance index for ETH"/>
              <param name="MCLK_ID_AXI" value="64" caption="Index for ETH AXI clock"/>
              <param name="MCLK_ID_APB" value="65" caption="Index for ETH APB clock"/>
              <param name="PAC_ID" value="56" caption="Index for ETH registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="ETM" id="SYSTEM_IP" version="1.0.0">
          <instance name="ETM">
            <register-group name="ETM" name-in-module="ETM" address-space="base" offset="0xE0041000"/>
