Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/atdf/PIC32CZ4010CA91176.atdf
        <module name="FPB" id="SYSTEM_IP" version="1.0.0">
          <instance name="FPB">
            <register-group name="FPB" name-in-module="FPB" address-space="base" offset="0xE0002000"/>
            <parameters>
              <param name="__BKPT_NUM" value="8" caption="Number of FPB breakpoint comparators"/>
            </parameters>
          </instance>
        </module>
        <module name="FPU" id="SYSTEM_IP" version="1.0.0">
          <instance name="FPU">
            <register-group name="FPU" name-in-module="FPU" address-space="base" offset="0xE000EF30"/>
            <parameters>
              <param name="__FPU_DP" value="1" caption="FPU double precision or not"/>
            </parameters>
          </instance>
        </module>
        <module name="FREQM" id="03707" name2="clk_freqm_u2257_v3" version="3a0">
          <instance name="FREQM">
            <register-group name="FREQM" name-in-module="FREQM" address-space="base" offset="0x44060000"/>
            <parameters>
              <param name="GCLK_ID_MSR" value="3" caption="Index of measure generic clock"/>
              <param name="GCLK_ID_REF" value="4" caption="Index of reference generic clock"/>
              <param name="MSRCLK_NB" value="2" caption="Number of measured clock sources"/>
              <param name="INSTANCE_ID" value="10" caption="Instance index for FREQM"/>
              <param name="MCLK_ID_APB" value="13" caption="Index for FREQM APB clock"/>
              <param name="PAC_ID" value="10" caption="Index for FREQM registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" version="1.0.0">
          <instance name="FUSES">
            <register-group name="FUSES_BOOTCFG1" name-in-module="FUSES_BOOTCFG1" address-space="base" offset="0x0A002000"/>
            <register-group name="FUSES_BOOTCFG2" name-in-module="FUSES_BOOTCFG1" address-space="base" offset="0x0A00A000"/>
            <register-group name="FUSES_CALOTP" name-in-module="FUSES_CALOTP" address-space="base" offset="0x0A007000"/>
            <register-group name="FUSES_DALCFG" name-in-module="FUSES_DALCFG" address-space="base" offset="0x0A004000"/>
            <register-group name="FUSES_USERCFG1" name-in-module="FUSES_USERCFG1" address-space="base" offset="0x0A000000"/>
            <register-group name="FUSES_USERCFG2" name-in-module="FUSES_USERCFG1" address-space="base" offset="0x0A008000"/>
          </instance>
        </module>
        <module name="GCLK" id="03726" name2="clk_gclk_u2122_v1" version="1d0">
          <instance name="GCLK">
            <register-group name="GCLK" name-in-module="GCLK" address-space="base" offset="0x44050000"/>
            <signals>
              <signal group="IO" index="0" function="M" pad="PC20"/>
              <signal group="IO" index="1" function="M" pad="PC19"/>
              <signal group="IO" index="2" function="M" pad="PD00"/>
              <signal group="IO" index="3" function="M" pad="PD01"/>
              <signal group="IO" index="4" function="M" pad="PC00"/>
              <signal group="IO" index="4" function="M" pad="PD18"/>
              <signal group="IO" index="5" function="M" pad="PC01"/>
              <signal group="IO" index="5" function="M" pad="PD19"/>
              <signal group="IO" index="6" function="M" pad="PC02"/>
              <signal group="IO" index="6" function="M" pad="PD20"/>
              <signal group="IO" index="7" function="M" pad="PC03"/>
              <signal group="IO" index="7" function="M" pad="PD21"/>
              <signal group="spi_ixs_mclk0" function="J" pad="PC04"/>
              <signal group="spi_ixs_mclk0" function="J" pad="PD06"/>
              <signal group="spi_ixs_mclk1" function="J" pad="PA31"/>
            </signals>
            <parameters>
              <param name="GEN_BITS" value="4"/>
              <param name="GEN_NUM" value="16" caption="Number of Generic Clock Generators"/>
              <param name="GEN_NUM_MSB" value="15" caption="Number of Generic Clock Generators - 1"/>
              <param name="GEN_SOURCE_NUM_MSB" value="13" caption="Number of Generic Clock Sources - 1"/>
              <param name="IO_NUM" value="8" caption="Number of Generic Clock I/Os"/>
              <param name="NUM" value="64" caption="Number of Generic Clock Users"/>
              <param name="SOURCE_BITS" value="4"/>
              <param name="SOURCE_NUM" value="14" caption="Number of Generic Clock Sources"/>
              <param name="INSTANCE_ID" value="8" caption="Instance index for GCLK"/>
              <param name="MCLK_ID_APB" value="11" caption="Index for GCLK APB clock"/>
              <param name="PAC_ID" value="8" caption="Index for GCLK registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="HSM" id="03785" name2="sec_hsm_v1" version="1a0">
          <instance name="HSM">
            <register-group name="HSM" name-in-module="HSM" address-space="base" offset="0x4F018000"/>
            <parameters>
              <param name="g_ClkGating" value="1"/>
              <param name="MCLK_ID_AHB" value="77" caption="Index for HSM AHB clock"/>
            </parameters>
          </instance>
        </module>
        <module name="ITM" id="SYSTEM_IP" version="1.0.0">
          <instance name="ITM">
            <register-group name="ITM" name-in-module="ITM" address-space="base" offset="0xE0041000"/>
          </instance>
        </module>
        <module name="MCLK" id="04158" name2="clk_mclk_v1" version="1a0">
          <instance name="MCLK">
            <register-group name="MCLK" name-in-module="MCLK" address-space="base" offset="0x44052000"/>
            <parameters>
              <param name="DIV_CLK_NUM" value="2"/>
              <param name="INSTANCE_ID" value="9" caption="Instance index for MCLK"/>
              <param name="MCLK_ID_APB" value="12" caption="Index for MCLK APB clock"/>
              <param name="PAC_ID" value="9" caption="Index for MCLK registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="MCRAMC" id="03727" name2="drm_mcramc_v3" version="3b0">
          <instance name="MCRAMC">
            <register-group name="MCRAMC" name-in-module="MCRAMC" address-space="base" offset="0x44822000"/>
            <parameters>
              <param name="AHB_CLOCK_ENABLE" value="1" caption="MCRAMC CLOCK GATER"/>
              <param name="AHB_ECC" value="1" caption="ECC LOGIC"/>
              <param name="AHB_PORTS_NB" value="1" caption="NUMBER OF AHB PORTS"/>
              <param name="AHB_READ_PREBUFFERING" value="1" caption="AHB READ PREBUFFERING"/>
              <param name="AHB_REQUEST_ISOLATION_REGISTER" value="1" caption="AHB REQUEST TIMING PATHS ISOLATION"/>
              <param name="ARBITRATION_TYPE" value="2" caption="ARBITRATION SCHEME, FIXED_PRIORITY = 0, HIGHLIGHT = 1, HOPSCOTCH = 2"/>
              <param name="BIT_STROBE_RAM" value="0" caption="Set this parameter to TRUE if the ram_wem_bundle outputs are connected to ram bit-strobe write masks"/>
              <param name="CHANNELS_NB" value="1" caption="NUMBER OF RAM CHANNELS"/>
              <param name="ECC_SYNDROM_REGISTER" value="1" caption="ECC TIMING PATH BALANCING"/>
              <param name="HADDR_READ_ISOLATION_REGISTER" value="0" caption="Set to IMPLEMENTED to add 1 wait-state max (0 min) per memory new line read access for each of the AHB timing path isolations"/>
              <param name="HRDATA_ISOLATION_REGISTER" value="1" caption="AHB REQUEST TIMING PATHS ISOLATION"/>
              <param name="MCRAMC_CLK_GATER" value="1" caption="MCRAMC CLOCK GATER"/>
              <param name="MCRAMC_PADDR_SIZE" value="8" caption="APB USER INTERFACE"/>
              <param name="MEMORY_AUTO_CORRECTION" value="1" caption="Perform an automatic write-back of the corrected ram word after read"/>
              <param name="MEMORY_ENABLE_POLARITY" value="0" caption="POSITIVE if Memory is selected when ram_me is 1'b1"/>
              <param name="MW_CLOCK_ENABLE" value="0" caption="MCRAMC CLOCK GATER"/>
              <param name="MW_DATA_SIZE" value="32" caption="MW DATA BUS SIZE"/>
              <param name="MW_PORT_SLICES_NB" value="0" caption="NUMBER OF PORT SLICES FOR THE WAITED SRAM INTERFACE"/>
              <param name="M0_CLOCK_ENABLE" value="0" caption="MCRAMC CLOCK GATER"/>
              <param name="M0_DATA_SIZE" value="32" caption="M0 DATA BUS SIZE"/>
              <param name="M0_HYBRID_READ_WRITE_ACCESS" value="0" caption="M0 HYBRID SIMULTANEOUS READ + WRITE ACCESS"/>
              <param name="M0_PORT_SLICES_NB" value="0" caption="NUMBER OF PORT SLICES FOR THE 0 WS SRAM INTERFACE"/>
              <param name="RAM_ADD_SIZE" value="14" caption="NUMBER OF ADDRESS BITS FOR ONE CHANNEL RAM CELL"/>
              <param name="RAM_AHB_ADDRESS_OFFSET" value="0" caption="RAM BLOCK AHB ADDRESS OFFSET"/>
              <param name="STORE_BYTE_STROBE" value="0" caption="AHB byte strobes can be stored and read back through the M0 interface"/>
              <param name="ULTRA" value="1" caption="ULTRA USER INTERFACE"/>
              <param name="WRITE_ENABLE_POLARITY" value="0" caption="POSITIVE if Memory is written when ram_we is 1'b1"/>
              <param name="WRITE_ENABLE_USED" value="0" caption="TRUE  if the Memory makes use of a global per channel ram_we write enable"/>
              <param name="WRITE_MASK_POLARITY" value="0" caption="POSITIVE if Memory is written when ram_wem is 1'b1"/>
              <param name="INSTANCE_ID" value="16" caption="Instance index for MCRAMC"/>
              <param name="MCLK_ID_APB" value="20" caption="Index for MCRAMC APB clock"/>
              <param name="PAC_ID" value="16" caption="Index for MCRAMC registers write protection"/>
            </parameters>
          </instance>
        </module>
