Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/atdf/PIC32CZ4010CA91176.atdf
        <module name="PTC" id="03721" name2="afe_ptc_ctrl_u2215_v6" version="6a0">
          <instance name="PTC">
            <register-group name="PTC" name-in-module="PTC" address-space="base" offset="0x46828000"/>
            <signals>
              <signal group="DRV" index="0" function="P" pad="PB17"/>
              <signal group="DRV" index="1" function="P" pad="PB16"/>
              <signal group="DRV" index="2" function="P" pad="PB15"/>
              <signal group="DRV" index="3" function="P" pad="PB14"/>
              <signal group="DRV" index="4" function="P" pad="PB13"/>
              <signal group="DRV" index="5" function="P" pad="PB12"/>
              <signal group="DRV" index="6" function="P" pad="PB11"/>
              <signal group="DRV" index="7" function="P" pad="PB10"/>
              <signal group="DRV" index="8" function="P" pad="PB09"/>
              <signal group="DRV" index="9" function="P" pad="PB08"/>
              <signal group="DRV" index="10" function="P" pad="PB07"/>
              <signal group="DRV" index="11" function="P" pad="PB06"/>
              <signal group="DRV" index="12" function="P" pad="PB26"/>
              <signal group="DRV" index="13" function="P" pad="PB25"/>
              <signal group="DRV" index="14" function="P" pad="PB24"/>
              <signal group="DRV" index="15" function="P" pad="PB23"/>
              <signal group="DRV" index="16" function="P" pad="PB22"/>
              <signal group="DRV" index="17" function="P" pad="PB21"/>
              <signal group="DRV" index="18" function="P" pad="PB31"/>
              <signal group="DRV" index="19" function="P" pad="PB30"/>
              <signal group="DRV" index="20" function="P" pad="PB29"/>
              <signal group="DRV" index="21" function="P" pad="PF05"/>
              <signal group="DRV" index="22" function="P" pad="PB28"/>
              <signal group="DRV" index="23" function="P" pad="PB27"/>
              <signal group="ECI" index="0" function="P" pad="PC02"/>
              <signal group="ECI" index="1" function="P" pad="PC03"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_EOC" value="78" caption="Index of DMA EOC trigger"/>
              <param name="DMAC_ID_SEQ" value="76" caption="Index of DMA SEQ trigger"/>
              <param name="DMAC_ID_WCOMP" value="77" caption="Index of DMA WCOMP trigger"/>
              <param name="GCLK_ID" value="43" caption="Index of Generic Clock"/>
              <param name="LINES_NUM" value="32" caption="Number of PTC lines"/>
              <param name="INSTANCE_ID" value="45" caption="Instance index for PTC"/>
              <param name="MCLK_ID_APB" value="53" caption="Index for PTC APB clock"/>
              <param name="PAC_ID" value="45" caption="Index for PTC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="RSTC" id="03926" name2="pwr_rpmu_rstc_v1" version="1a0">
          <instance name="RSTC">
            <register-group name="RSTC" name-in-module="RSTC" address-space="base" offset="0x44030000"/>
            <parameters>
              <param name="BACKUP_IMPLEMENTED" value="1"/>
              <param name="CM_DBGRESET_STRETCHED" value="12" caption="Reset stretcher size for Cortex CPU related to DBGRESET."/>
              <param name="CM_HRESET_N_STRETCHED" value="12" caption="Reset stretcher size for Cortex CPU related to HRESETn."/>
              <param name="CM_PORESET_STRETCHED" value="12" caption="Reset stretcher size for Cortex CPU related to PORESET."/>
              <param name="HIB_IMPLEMENTED" value="1"/>
              <param name="VBAT_IMPLEMENTED" value="0" caption="One if VBAT (Battery backup mode) is supported"/>
              <param name="INSTANCE_ID" value="5" caption="Instance index for RSTC"/>
              <param name="MCLK_ID_APB" value="8" caption="Index for RSTC APB clock"/>
              <param name="PAC_ID" value="5" caption="Index for RSTC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="03608" name2="tmr_rtc_u2250_v3" version="3b0">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x44072000"/>
            <signals>
              <signal group="IN" index="0" function="RTC_IN" pad="PB09"/>
              <signal group="IN" index="1" function="RTC_IN" pad="PB08"/>
              <signal group="IN" index="2" function="RTC_IN" pad="PB10"/>
              <signal group="IN" index="3" function="RTC_IN" pad="PB11"/>
              <signal group="IN" index="4" function="RTC_IN" pad="PB01"/>
              <signal group="IN" index="5" function="RTC_IN" pad="PB19"/>
              <signal group="IN" index="6" function="RTC_IN" pad="PB22"/>
              <signal group="IN" index="7" function="RTC_IN" pad="PB24"/>
              <signal group="OUT" index="0" function="RTC_OUT" pad="PB07"/>
              <signal group="OUT" index="1" function="RTC_OUT" pad="PB00"/>
              <signal group="OUT" index="2" function="RTC_OUT" pad="PB02"/>
              <signal group="OUT" index="3" function="RTC_OUT" pad="PB03"/>
              <signal group="OUT" index="4" function="RTC_OUT" pad="PB26"/>
              <signal group="OUT" index="5" function="RTC_OUT" pad="PB18"/>
              <signal group="OUT" index="6" function="RTC_OUT" pad="PB21"/>
              <signal group="OUT" index="7" function="RTC_OUT" pad="PB23"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TIMESTAMP" value="4" caption="DMA RTC timestamp trigger"/>
              <param name="NUM_OF_ALARMS" value="2" caption="Number of Alarms"/>
              <param name="NUM_OF_BKREGS" value="0" caption="Number of Backup Registers"/>
              <param name="NUM_OF_COMP16" value="4" caption="Number of 16-bit Comparators"/>
              <param name="NUM_OF_TAMPERS" value="8" caption="Number of Tamper Inputs"/>
              <param name="INSTANCE_ID" value="12" caption="Instance index for RTC"/>
              <param name="MCLK_ID_APB" value="15" caption="Index for RTC APB clock"/>
              <param name="PAC_ID" value="12" caption="Index for RTC registers write protection"/>
            </parameters>
          </instance>
        </module>
