Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/atdf/PIC32CZ4010CA91176.atdf
        <register name="POWER" offset="0x1001" rw="RW" size="1" initval="0x20" caption="Used For Controlling Suspend And Resume Signaling And Some Basic Operation Of USBCORE">
          <bitfield name="ENABLESUSPENDM" caption="set by the cpu to enable suspendm output" mask="0x1"/>
          <bitfield name="SUSPENDMODE" caption="set by cpu to enter suspend mode" mask="0x2"/>
          <bitfield name="RESUME" caption="set by cpu to generate resume signaling when te device is in suspend" mask="0x4"/>
          <bitfield name="RESET" caption="this bit is set when reset signaling is present on the bus" mask="0x8"/>
          <bitfield name="HSMODE" caption="when set this read only bit indicates high speed mode successfully negotiated during usb reset" mask="0x10"/>
          <bitfield name="HSENABLE" caption="when set by cpu the usbcore will negotiate the high speed mode" mask="0x20"/>
          <bitfield name="SOFTCONN" caption="if enabled the D+ D- lines are enabled when this bit is set by the cpu" mask="0x40"/>
          <bitfield name="ISOUPDATE" caption="when set by cpu the usbcore will wait for an sof token" mask="0x80"/>
        </register>
        <register name="INTRTX" offset="0x1002" rw="R" ocd-rw="" size="2" atomic-op="clear:INTRTX" initval="0x0000" caption="Read Only Register Which Indicates Which Interrupts Are Currently Active For EP0 And TX EP1-15">
          <bitfield name="EP0TX" caption="Interrupts Active For TX0 Endpoint" mask="0x1"/>
          <bitfield name="EP1TX" caption="Interrupts Active For TX1 Endpoint" mask="0x2"/>
          <bitfield name="EP2TX" caption="Interrupts Active For TX2 Endpoint" mask="0x4"/>
          <bitfield name="EP3TX" caption="Interrupts Active For TX3 Endpoint" mask="0x8"/>
          <bitfield name="EP4TX" caption="Interrupts Active For TX4 Endpoint" mask="0x10"/>
          <bitfield name="EP5TX" caption="Interrupts Active For TX5 Endpoint" mask="0x20"/>
          <bitfield name="EP6TX" caption="Interrupts Active For TX6 Endpoint" mask="0x40"/>
          <bitfield name="EP7TX" caption="Interrupts Active For TX7 Endpoint" mask="0x80"/>
        </register>
        <register name="INTRRX" offset="0x1004" rw="R" ocd-rw="" size="2" atomic-op="clear:INTRRX" initval="0x0000" caption="Read Only Register Which Indicates Which Interrupts Are Currently Active For RX EP1-15">
          <bitfield name="EP1RX" caption="Interrupts Active For Which RX1 Endpoint" mask="0x2"/>
          <bitfield name="EP2RX" caption="Interrupts Active For Which RX2 Endpoint" mask="0x4"/>
          <bitfield name="EP3RX" caption="Interrupts Active For Which RX3 Endpoint" mask="0x8"/>
          <bitfield name="EP4RX" caption="Interrupts Active For Which RX4 Endpoint" mask="0x10"/>
          <bitfield name="EP5RX" caption="Interrupts Active For Which RX5 Endpoint" mask="0x20"/>
          <bitfield name="EP6RX" caption="Interrupts Active For Which RX6 Endpoint" mask="0x40"/>
          <bitfield name="EP7RX" caption="Interrupts Active For Which RX7 Endpoint" mask="0x80"/>
        </register>
        <register name="INTRTXE" offset="0x1006" rw="RW" size="2" initval="0xFFFF" caption="Interrupt Enable Bits for INTRTX">
          <bitfield name="EP0TXEN" caption="Interrupt Enabled for TX EP0" mask="0x1"/>
          <bitfield name="EP1TXEN" caption="Interrupt Enabled for TX EP1" mask="0x2"/>
          <bitfield name="EP2TXEN" caption="Interrupt Enabled for TX EP2" mask="0x4"/>
          <bitfield name="EP3TXEN" caption="Interrupt Enabled for TX EP3" mask="0x8"/>
          <bitfield name="EP4TXEN" caption="Interrupt Enabled for TX EP4" mask="0x10"/>
          <bitfield name="EP5TXEN" caption="Interrupt Enabled for TX EP5" mask="0x20"/>
          <bitfield name="EP6TXEN" caption="Interrupt Enabled for TX EP6" mask="0x40"/>
          <bitfield name="EP7TXEN" caption="Interrupt Enabled for TX EP7" mask="0x80"/>
        </register>
        <register name="INTRRXE" offset="0x1008" rw="RW" size="2" initval="0xFFFE" caption="Interrupt Enable Bits for INTRRX">
          <bitfield name="EP1RXE" caption="Interrupt Enabled for RX EP1" mask="0x2"/>
          <bitfield name="EP2RXE" caption="Interrupt Enabled for RX EP2" mask="0x4"/>
          <bitfield name="EP3RXE" caption="Interrupt Enabled for RX EP3" mask="0x8"/>
          <bitfield name="EP4RXE" caption="Interrupt Enabled for RX EP4" mask="0x10"/>
          <bitfield name="EP5RXE" caption="Interrupt Enabled for RX EP5" mask="0x20"/>
          <bitfield name="EP6RXE" caption="Interrupt Enabled for RX EP6" mask="0x40"/>
          <bitfield name="EP7RXE" caption="Interrupt Enabled for RX EP7" mask="0x80"/>
        </register>
        <register name="INTRUSB" offset="0x100A" rw="R" size="1" atomic-op="clear:INTRUSB" initval="0x00" caption="Read Only Register Which Indicates Which USB Interrupts Are Currently Active.">
          <bitfield name="SUSPEND" caption="Set When Suspend Signal Is Detected On The Bus" mask="0x1"/>
          <bitfield name="RESUME" caption="Set When Resume Signal Is Detected On The Bus" mask="0x2"/>
          <bitfield name="RESET" caption="Set In Peripheral Mode when Reset Is Detected On The Bus. In HostMode When Babble Is Detected" mask="0x4"/>
          <bitfield name="SOF" caption="Set When A New Frame Starts" mask="0x8"/>
          <bitfield name="CONN" caption="Set When A Device Connection Is Detected" mask="0x10"/>
          <bitfield name="DISCON" caption="Set In Host Mode When A Device Disconnect Is Detected.Set In Peripheral Mode When A Session Ends" mask="0x20"/>
          <bitfield name="SESSREQ" caption="Set When Session Request Signaling Has Been Detected." mask="0x40"/>
          <bitfield name="VBUSERR" caption="Set When VBus Drops Below The VBus Valid Threshold During A Session." mask="0x80"/>
        </register>
        <register name="INTRUSBE" offset="0x100B" rw="RW" size="1" initval="0x06" caption="Interrupt Enable Bits for USB Interrupts">
          <bitfield name="SUSPENDEN" caption="SUSEPND Interrupt Enable" mask="0x1"/>
          <bitfield name="RESUMEEN" caption="RESUME Interrupt Enable" mask="0x2"/>
          <bitfield name="RESETEN" caption="RESET/BABBLE Interrupt Enable" mask="0x4"/>
          <bitfield name="SOFEN" caption="SOF Interrupt Enable" mask="0x8"/>
          <bitfield name="CONNEN" caption="CONN Interrupt Enable" mask="0x10"/>
          <bitfield name="DISCONEN" caption="DISCONN Interrupt Enable" mask="0x20"/>
          <bitfield name="SESSREQEN" caption="SESSREQ Interrupt Enable" mask="0x40"/>
          <bitfield name="VBUSERREN" caption="VBus Error Interrupt Enable" mask="0x80"/>
        </register>
